{
  "model_name": "GRU",
  "timestamp": "2026-04-03T14:45:15.093143",
  "total_parameters": 180929,
  "trainable_parameters": 180929,
  "non_trainable_parameters": 0,
  "model_config": {
    "name": "sequential_3",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            128,
            50
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer_3"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Embedding",
        "config": {
          "name": "embedding_3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "input_dim": 5000,
          "output_dim": 32,
          "embeddings_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomUniform",
            "config": {
              "seed": null,
              "minval": -0.05,
              "maxval": 0.05
            },
            "registered_name": null
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": false
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            128,
            50
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "GRU",
        "config": {
          "name": "gru",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "zero_output_for_mask": false,
          "units": 64,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": {
              "seed": null,
              "gain": 1.0
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.3,
          "recurrent_dropout": 0.3,
          "reset_after": true,
          "seed": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            128,
            50,
            32
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_7",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": {
            "module": "keras.regularizers",
            "class_name": "L2",
            "config": {
              "l2": 0.01
            },
            "registered_name": null
          },
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            128,
            64
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.5,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_8",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            128,
            32
          ]
        }
      }
    ],
    "build_input_shape": [
      128,
      50
    ]
  },
  "experiment_config": {
    "DATA_PATH": "IMDB Dataset.csv",
    "OUTPUT_DIR": "./sentiment_deep_models_output",
    "CLASSICAL_MODELS_DIR": "./sentiment_student1_output",
    "MAX_FEATURES": 5000,
    "MAX_LEN": 50,
    "EMBEDDING_DIM": 32,
    "BATCH_SIZE": 128,
    "EPOCHS": 5,
    "VALIDATION_SPLIT": 0.2,
    "RANDOM_STATE": 42,
    "USE_GLOVE": false,
    "GLOVE_PATH": null
  }
}