{
  "model_name": "Transformer",
  "timestamp": "2026-04-03T14:46:36.251676",
  "total_parameters": 170721,
  "trainable_parameters": 170721,
  "non_trainable_parameters": 0,
  "model_config": {
    "name": "functional_5",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            50
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer_5"
        },
        "registered_name": null,
        "name": "input_layer_5",
        "inbound_nodes": []
      },
      {
        "module": "keras.layers",
        "class_name": "Embedding",
        "config": {
          "name": "embedding_5",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "input_dim": 5000,
          "output_dim": 32,
          "embeddings_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomUniform",
            "config": {
              "seed": null,
              "minval": -0.05,
              "maxval": 0.05
            },
            "registered_name": null
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": false
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            50
          ]
        },
        "name": "embedding_5",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "input_layer_5",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "MultiHeadAttention",
        "config": {
          "name": "multi_head_attention",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "num_heads": 4,
          "key_dim": 8,
          "value_dim": 8,
          "dropout": 0.1,
          "use_bias": true,
          "output_shape": null,
          "attention_axes": [
            1
          ],
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "seed": null
        },
        "registered_name": null,
        "build_config": {
          "shapes_dict": {
            "query_shape": [
              null,
              50,
              32
            ],
            "value_shape": [
              null,
              50,
              32
            ]
          }
        },
        "name": "multi_head_attention",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50,
                    32
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "embedding_5",
                    0,
                    0
                  ]
                }
              },
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50,
                    32
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "embedding_5",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              50,
              32
            ],
            [
              null,
              50,
              32
            ]
          ]
        },
        "name": "add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      50,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "embedding_5",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      50,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "multi_head_attention",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "LayerNormalization",
        "config": {
          "name": "layer_normalization",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": [
            -1
          ],
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "rms_scaling": false,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            50,
            32
          ]
        },
        "name": "layer_normalization",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50,
                    32
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "add",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_11",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            50,
            32
          ]
        },
        "name": "dense_11",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50,
                    32
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "layer_normalization",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_7",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.2,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null,
        "name": "dropout_7",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50,
                    64
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_11",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {
              "training": false
            }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_12",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            50,
            64
          ]
        },
        "name": "dense_12",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50,
                    64
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dropout_7",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "add_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              50,
              32
            ],
            [
              null,
              50,
              32
            ]
          ]
        },
        "name": "add_1",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      50,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "layer_normalization",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      50,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_12",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "LayerNormalization",
        "config": {
          "name": "layer_normalization_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": [
            -1
          ],
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "rms_scaling": false,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            50,
            32
          ]
        },
        "name": "layer_normalization_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50,
                    32
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "add_1",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "GlobalAveragePooling1D",
        "config": {
          "name": "global_average_pooling1d",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "data_format": "channels_last",
          "keepdims": false
        },
        "registered_name": null,
        "name": "global_average_pooling1d",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    50,
                    32
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "layer_normalization_1",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {
              "mask": null
            }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_8",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.3,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null,
        "name": "dropout_8",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    32
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "global_average_pooling1d",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {
              "training": false
            }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_13",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": {
            "module": "keras.regularizers",
            "class_name": "L2",
            "config": {
              "l2": 0.01
            },
            "registered_name": null
          },
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            32
          ]
        },
        "name": "dense_13",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    32
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dropout_8",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_9",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.5,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null,
        "name": "dropout_9",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    64
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_13",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {
              "training": false
            }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_14",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            64
          ]
        },
        "name": "dense_14",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    64
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dropout_9",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      }
    ],
    "input_layers": [
      "input_layer_5",
      0,
      0
    ],
    "output_layers": [
      "dense_14",
      0,
      0
    ]
  },
  "experiment_config": {
    "DATA_PATH": "IMDB Dataset.csv",
    "OUTPUT_DIR": "./sentiment_deep_models_output",
    "CLASSICAL_MODELS_DIR": "./sentiment_student1_output",
    "MAX_FEATURES": 5000,
    "MAX_LEN": 50,
    "EMBEDDING_DIM": 32,
    "BATCH_SIZE": 128,
    "EPOCHS": 5,
    "VALIDATION_SPLIT": 0.2,
    "RANDOM_STATE": 42,
    "USE_GLOVE": false,
    "GLOVE_PATH": null
  }
}